shivam6279/Arduino/hardware/microbridge/avr/boards.txt
microbridge.name=Arduino Mega 2560 (DUAL SD Bootloader)

microbridge.upload.protocol=stk500v2
microbridge.upload.maximum_size=258048
microbridge.upload.speed=115200

microbridge.bootloader.low_fuses=0xFF
microbridge.bootloader.high_fuses=0xD8
microbridge.bootloader.extended_fuses=0xFD
microbridge.bootloader.file=microbridge/stk500boot.hex
microbridge.bootloader.unlock_bits=0x3F
microbridge.bootloader.lock_bits=0x0F

microbridge.build.mcu=atmega2560
microbridge.build.f_cpu=16000000L
microbridge.build.core=arduino:arduino
microbridge.build.variant=arduino:mega

microbridge.build.board=AVR_MICROBRIDGE

microbridge.upload.tool=arduino:avrdude
microbridge.bootloader.tool=arduino:avrdude
